alert("Задання номер 2");
const total = 100;
let ordered = prompt("Вкажіть кількість замовлення, в наявності: 100");
if (ordered <= total) {
  alert("Замовлення оформлено");
} else {
  alert("На складі недостатня кількість товару!");
}

// Альтернативні перевірки

alert("Альтернативна перевірка валідності");

let ordered_2 = prompt("Вкажіть кількість замовлення, в наявності: 100");

if (ordered_2 <= total) {
  alert("Замовлення оформлено");
} else {
  alert("На складі недостатня кількість товару!");
}
